#include "MyFun.h"

/*
	* Project content：Roll call system
	* Creating time: 2021-06-08
	* Founder: Jingjie
	* Code function：
		随机点名系统（输入1~3）：
			输入1输出所有人名单
				按0进行退出
			输入2随机点名（可重复）
				按0进行退出
				按1继续点名
			输入3随机点名（不可重复）
				按0进行退出
				按1继续点名	
*/

int main(int agrc, char* argv)
{
	//system("chcp 65001");
	//设置初始值
	srand((unsigned)time(NULL));
	system("cls");
	int num = 0;
	char Allname[][10] =
	{
	"杨泽宇", "刘昊",  "金亮",  "倪凯政", "杨波",
	"唐辉辉", "刘浩",  "程昱豪", "彭勇杰", "明鑫",
	"樊惠健", "邓淳潇","张彬",   "田琪",   "翟熙健",
	"穆文超", "高子阳","刘子源", "游志勇", "陈斌杰",
	"景杰",   "潘昊",  "包智尚", "孙凯",   "李广深",
	"巩学金", "张俊卿","杨彬",   "权一帆", "谈一飞",
	"罗立坤", "陈华北","方杨",   "高金旺", "潘洋",
	"要忠强", "曾淇",  "宋江源", "徐道亮", "胡铁川",
	"宋易霖", "温奥宇","张金辅", "周睿",   "宋睿",
	"刘凯",   "葛金",  "刘承鑫", "张艺顺", "吴冬",
	"徐嘉龙", "高帅",  "赵南北", "唐淞",   "刘琪",
	};

	//班级人员数量
	num = sizeof(Allname) / sizeof(Allname[0]);
	printf("<==========================>\n");
	printf("   1. 查看所有人姓名        \n");
	printf("   2. 随机点名（可重复)     \n");
	printf("   3. 随机点名（不可重复）  \n");
	printf("   4. 退出                  \n");
	printf("<==========================>\n");
	//进入监听事件
	Startloop(num, Allname);
	return 0;
}


